; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph0 - mode
	infrared3 - mode
	infrared1 - mode
	spectrograph2 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
)
(:goal (and
	(have_image Phenomenon5 infrared1)
	(have_image Phenomenon6 infrared1)
	(have_image Planet7 infrared1)
	(have_image Star8 thermograph0)
	(have_image Star9 thermograph0)
	(have_image Planet10 spectrograph2)
	(have_image Planet11 thermograph0)
))

)

; plan
1. (turn_to satellite0 groundstation0 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 planet11 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet11)
   goals met: 0 of 7
5. (take_image satellite0 planet11 instrument0 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 1 of 7
6. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 1 of 7
7. (take_image satellite0 planet10 instrument0 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon6 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon6 instrument0 infrared1)
   added: (have_image phenomenon6 infrared1)
   goals met: 3 of 7
10. (turn_to satellite0 phenomenon5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 7
11. (take_image satellite0 phenomenon5 instrument0 infrared1)
   added: (have_image phenomenon5 infrared1)
   goals met: 4 of 7
12. (turn_to satellite0 planet7 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet7)
   goals met: 4 of 7
13. (take_image satellite0 planet7 instrument0 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 5 of 7
14. (turn_to satellite0 star8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star8)
   goals met: 5 of 7
15. (take_image satellite0 star8 instrument0 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 6 of 7
16. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 6 of 7
17. (take_image satellite0 star9 instrument0 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 7 of 7
